УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_УИДыГИС/КонтурЛогистика_УИДыГИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УИДыГИС</name>
  <comment>Хранит пул доступных для использования УИДов минтранса</comment>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата операции добавления / использования</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_УИДыГИС/ManagerModule.bsl
Функция ОсталосьСвободныхУИДов(Организация) Экспорт
	
	ПериодАктуальностиУИД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПериодАктуальностиУИД");
	
	МассивОрганизаций = Новый Массив;
	МассивОрганизаций.Добавить(Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(Организация) Тогда
		МассивОрганизаций.Добавить(Организация);		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(КонтурЛогистика_УИДыГИС.УИД) КАК Остаток
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
	               |ГДЕ
	               |	НЕ КонтурЛогистика_УИДыГИС.Использован
	               |	И КонтурЛогистика_УИДыГИС.Организация В(&МассивОрганизаций)
	               |	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_УИДыГИС.ДатаОперации, МЕСЯЦ, &ПериодАктуальностиУИД), ДЕНЬ) >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ПериодАктуальностиУИД", ПериодАктуальностиУИД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ОстатокУИДов = Выборка.Остаток;
	Иначе
		ОстатокУИДов = 0;
	КонецЕсли;
	
	Возврат ОстатокУИДов;
	
КонецФункции

Функция ПолучитьОчередной(Организация = Неопределено) Экспорт
	
	ПериодАктуальностиУИД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПериодАктуальностиУИД");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_УИДыГИС.УИД КАК УИД,
		|	КонтурЛогистика_УИДыГИС.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|ГДЕ
		|	НЕ КонтурЛогистика_УИДыГИС.Использован
		|	И КонтурЛогистика_УИДыГИС.Организация = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
		|	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_УИДыГИС.ДатаОперации, МЕСЯЦ, &ПериодАктуальностиУИД), ДЕНЬ) >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_УИДыГИС.УИД,
		|	КонтурЛогистика_УИДыГИС.Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|ГДЕ
		|	НЕ КонтурЛогистика_УИДыГИС.Использован
		|	И КонтурЛогистика_УИДыГИС.Организация = &Организация
		|	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_УИДыГИС.ДатаОперации, МЕСЯЦ, &ПериодАктуальностиУИД), ДЕНЬ) >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация";
	
	Запрос.УстановитьПараметр("ПериодАктуальностиУИД", ПериодАктуальностиУИД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Организация = Выборка.Организация;
		Возврат Выборка.УИД;
		
	Иначе
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
		
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			
			ЭтоТестовыйСервер = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
			
			Если ЭтоТестовыйСервер = Истина Тогда
				
				РазмерПулаПолученияУИДМинтранса = 1;
				
			Иначе
				
				Попытка
					РазмерПулаПолученияУИДМинтранса = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
						"РазмерПулаПолученияУИДМинтранса");
				Исключение
					РазмерПулаПолученияУИДМинтранса = 100;
				КонецПопытки;
				
			КонецЕсли;
			
			УИДыИзПула = ПолучитьМассивУИДовИзПулаМинтранса(РазмерПулаПолученияУИДМинтранса, Организация, ПараметрыСервиса);
			
			Если УИДыИзПула.Количество() Тогда
				ЗагрузитьМассивУИДов(УИДыИзПула, Организация);
				
				Возврат УИДыИзПула[0];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОтметитьИспользованным(УИД, Организация) Экспорт
	
	УдачноОтмечен = Ложь;
	
	МенЗап = СоздатьМенеджерЗаписи();
	МенЗап.УИД = УИД;
	МенЗап.Организация = Организация;
	МенЗап.Прочитать();
	
	Если МенЗап.Использован Тогда 
		УдачноОтмечен = Ложь;
	Иначе
		МенЗап.Использован = Истина;
		МенЗап.ДатаОперации = ТекущаяДатаСеанса();
		МенЗап.Записать(Истина);
		УдачноОтмечен = Истина;
	КонецЕсли;
	
	Возврат УдачноОтмечен;
	
КонецФункции

Функция ЗагрузитьПулУИДовЧерезAPI(КоличествоУИДов, Организация) Экспорт
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
		"Начал получение УИДов из пула в количестве " + КоличествоУИДов + " шт.");
	
	Массив = ПолучитьМассивУИДовИзПулаМинтранса(КоличествоУИДов, Организация);
	
	Если Массив.Количество() Тогда
		ЗагрузитьМассивУИДов(Массив, Организация);
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Загрузил УИДы в регистр ""УИДы ГИС Минтранса (Контур.Логистика)"" в количестве " + Массив.Количество() + " шт.");
		
	Иначе
		Сообщить("Не смог получить УИДы из пула Минтранса.");
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМассивУИДовИзПулаМинтранса(КоличествоУИДов, Организация, ПараметрыСервиса = Неопределено) Экспорт
	
	Если ПараметрыСервиса = Неопределено Тогда
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
	КонецЕсли;
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
		ВызватьИсключение "Ни у одной из наших организаций не заполнена авторизация в Логистике";
	КонецЕсли;
	
	МассивУИДов = Новый Массив;
	
	boxId = Неопределено;
	Если ЗначениеЗаполнено(Организация) Тогда
		boxId = Организация.ID;
	КонецЕсли;
	
	МассивУИДов = КонтурЛогистика_API_Логистика.ПолучитьУИДыИзПулаМинтранса(ПараметрыСервиса, КоличествоУИДов, boxId);
	
	Возврат МассивУИДов;

КонецФункции

Функция ЗагрузитьМассивУИДов(МассивУИДов, Организация) Экспорт
	
	Для Каждого УИД Из МассивУИДов Цикл
		
		МенеджерЗаписи = РегистрыСведений.КонтурЛогистика_УИДыГИС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДатаОперации = ТекущаяДатаСеанса();
		МенеджерЗаписи.УИД = УИД;
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.Записать(Ложь);
		
	КонецЦикла;
	
КонецФункции
